In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df['FlightNumber']=df['FlightNumber'].interpolate().astype('int')

In [5]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [6]:
t=pd.DataFrame(df.From_To)

In [7]:
t.head()

            From_To
0      LoNDon_paris
1      MAdrid_miLAN
2  londON_StockhOlm
3    Budapest_PaRis
4   Brussels_londOn

In [8]:
t['Start']=t.From_To.str.split('_').str[0]

In [9]:
t['Start']

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: Start, dtype: object

In [10]:
t['Stop']=t.From_To.str.split('_').str[1]

In [11]:
t['Stop']

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: Stop, dtype: object

In [12]:
t.drop('From_To',axis=1,inplace=True)

In [13]:
t['Start']=t['Start'].str.title()

In [14]:
t['Start']

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: Start, dtype: object

In [15]:
t['Stop']=t['Stop'].str.title()

In [16]:
t['Stop']

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: Stop, dtype: object

In [17]:
t.head()

      Start       Stop
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [18]:
df=df.drop('From_To',axis=1)

In [19]:
df.head()

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [20]:
df=pd.concat([df,t],axis=1)

In [21]:
df.head()

   FlightNumber  RecentDelays              Airline     Start       Stop
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [22]:
val=pd.DataFrame(df['RecentDelays'].tolist(),columns=['delay_1','delay_2','delay_3'])

In [23]:
val

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [24]:
df=df.drop('RecentDelays',axis=1)

In [25]:
df.head()

   FlightNumber              Airline     Start       Stop
0         10045               KLM(!)    London      Paris
1         10055    <Air France> (12)    Madrid      Milan
2         10065  (British Airways. )    London  Stockholm
3         10075       12. Air France  Budapest      Paris
4         10085          "Swiss Air"  Brussels     London

In [26]:
df.insert(2,'Delay_1',val['delay_1'])
df.insert(3,'Delay_2',val['delay_2'])
df.insert(4,'Delay_3',val['delay_3'])

In [27]:
df.head()

,FlightNumber,Airline,Delay_1,Delay_2,Delay_3,Start,Stop
0,10045,KLM(!),23.0,47.0,NaN,London,Paris
1,10055,<Air France> (12),NaN,NaN,NaN,Madrid,Milan
2,10065,(British Airways. ),24.0,43.0,87.0,London,Stockholm
3,10075,12. Air France,13.0,NaN,NaN,Budapest,Paris
4,10085,"""Swiss Air""",67.0,32.0,NaN,Brussels,London